index.org
#+html_head: <link rel="stylesheet" href="css/org-page.css"/>
#+title: 謝宇恆 // xieyuheng

- welcome ^-^/

* me

  - Hi I am xieyuheng.
    I like mathematics, philosophy and traditional Chinese.

  - I view myself as a programming language designer.
    I am always trying to design programming languages.

  - My aim of programming language design
    is to explore the usage of 'proposition as type'
    for algebraic topological purpose.

*** experiences

***** 2015

      - Graduated from SYSU, GuangZhou, China, with bachelor's degree.
        My major was pure and applied mathematics.

***** 2015 -- 2017

      - Rest -- like an interval of silence in a piece of music.

***** 2017 -- 2018

      - Three months as a python programmer,
        at a Chinese company which builds online quantitative trading system,
        just like Quantopian.

***** 2018 -- now

      - Writing a prover.

*** contact

    - github : https://github.com/xieyuheng
    - email : xyheme (at) gmail (dot) com

* language design

  - [[https://github.com/xieyuheng/continua][continua]] -- about algebraic topology

  - [[https://github.com/xieyuheng/cicada][cicada language]] -- cicada language

  - [[https://github.com/xieyuheng/jojo-in-js][jojo]] -- jojo's programming adventure

  - [[https://github.com/xieyuheng/cicada-nymph][cicada-nymph]] -- a forth-like language

* paper

  - [[./output/function-compose-type-cut.html][function compose, type cut, and the algebra of logic]] ([[http://xieyuheng.github.io/paper/function-compose-type-cut.pdf][paper]]) ([[./output/function-compose-type-cut--demo.html][demo]])
    for the ICFP 2016 at Nara

* translation

  - [[./translation/is-god-a-taoist.html][is god a taoist / 上帝是道家的嗎]]
    by Raymond Smullyan, 1977

  - [[./translation/schizophrenia-in-contemporary-mathematics.html][schizophrenia in contemporary mathematics / 當代數學之精神分裂症]]
    by Errett Bishop, 1973

    - four basic principles for constructivism / 構造主義基本四原則

      - (A) Mathematics is common sense.
        (B) Do not ask whether a statement is true until you know what it means.
        (C) A proof is any completely convincing argument.
        (D) Meaningful distinctions deserve to be maintained.

      - (A) 數學即常識
        (B) 別問一個論斷是否真實 除非你明瞭論斷的意思
        (C) 使你信服的論證皆爲證明
        (D) 有意義的區別值得保留

  - [[./translation/a-constructivist-manifesto.html][a constructivist manifesto / 一個構造主義者的宣言]]
    by Errett Bishop, 1967

* lecture

  - [[http://the-little-language-designer.github.io/cicada-nymph/course/contents.html][experimental assembly programming experiment]]
    at SYSU, GuangZhou, 2015
