index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-04 Sun 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>謝宇恆 // xieyuheng</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">謝宇恆 // xieyuheng</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8fa1ee3">me</a>
<ul>
<li><a href="#orgc1ceb0a">experiences</a>
<ul>
<li><a href="#orgc722fa2">2015</a></li>
<li><a href="#orga486b3f">2015 &#x2013; 2017</a></li>
<li><a href="#orgf5e25af">2017 &#x2013; 2018</a></li>
<li><a href="#org3d34c65">2018 &#x2013; now</a></li>
</ul>
</li>
<li><a href="#org9eceae">contact</a></li>
</ul>
</li>
<li><a href="#org15a5133">language design</a></li>
<li><a href="#orgdc41e23">paper</a></li>
<li><a href="#org2efae31">translation</a></li>
<li><a href="#org29efd88">lecture</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>welcome ^-^/</p></li></ul>

<div id="outline-container-org8fa1ee3" class="outline-2">
<h2 id="org8fa1ee3">me</h2>
<div class="outline-text-2" id="text-org8fa1ee3">
<ul class="org-ul">
<li><p>Hi I am xieyuheng.</p><p>I like mathematics, philosophy and traditional Chinese.</p></li>

<li><p>I view myself as a programming language designer.</p><p>I am always trying to design programming languages.</p></li>

<li><p>My aim of programming language design</p><p>is to explore the usage of 'proposition as type'</p><p>for algebraic topological purpose.</p></li></ul>
</div>

<div id="outline-container-orgc1ceb0a" class="outline-3">
<h3 id="orgc1ceb0a">experiences</h3>
<div class="outline-text-3" id="text-orgc1ceb0a">
</div><div id="outline-container-orgc722fa2" class="outline-4">
<h4 id="orgc722fa2">2015</h4>
<div class="outline-text-4" id="text-orgc722fa2">
<ul class="org-ul">
<li><p>Graduated from SYSU, GuangZhou, China, with bachelor's degree.</p><p>My major was pure and applied mathematics.</p></li></ul>
</div>
</div>

<div id="outline-container-orga486b3f" class="outline-4">
<h4 id="orga486b3f">2015 &#x2013; 2017</h4>
<div class="outline-text-4" id="text-orga486b3f">
<ul class="org-ul">
<li><p>Rest &#x2013; like an interval of silence in a piece of music.</p></li></ul>
</div>
</div>

<div id="outline-container-orgf5e25af" class="outline-4">
<h4 id="orgf5e25af">2017 &#x2013; 2018</h4>
<div class="outline-text-4" id="text-orgf5e25af">
<ul class="org-ul">
<li><p>Three months as a python programmer,</p><p>at a Chinese company which builds online quantitative trading system,</p><p>just like Quantopian.</p></li></ul>
</div>
</div>

<div id="outline-container-org3d34c65" class="outline-4">
<h4 id="org3d34c65">2018 &#x2013; now</h4>
<div class="outline-text-4" id="text-org3d34c65">
<ul class="org-ul">
<li><p>Writing a prover.</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org9eceae" class="outline-3">
<h3 id="org9eceae">contact</h3>
<div class="outline-text-3" id="text-org9eceae">
<ul class="org-ul">
<li><p>github : <a href="https://github.com/xieyuheng">https://github.com/xieyuheng</a></p></li>
<li><p>email : xyheme (at) gmail (dot) com</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org15a5133" class="outline-2">
<h2 id="org15a5133">language design</h2>
<div class="outline-text-2" id="text-org15a5133">
<ul class="org-ul">
<li><p><a href="https://github.com/xieyuheng/continua">continua</a> &#x2013; about algebraic topology</p></li>

<li><p><a href="https://github.com/xieyuheng/cicada">cicada language</a> &#x2013; cicada language</p></li>

<li><p><a href="https://github.com/xieyuheng/jojo-in-js">jojo</a> &#x2013; jojo's programming adventure</p></li>

<li><p><a href="https://github.com/xieyuheng/cicada-nymph">cicada-nymph</a> &#x2013; a forth-like language</p></li></ul>
</div>
</div>

<div id="outline-container-orgdc41e23" class="outline-2">
<h2 id="orgdc41e23">paper</h2>
<div class="outline-text-2" id="text-orgdc41e23">
<ul class="org-ul">
<li><p><a href="./output/function-compose-type-cut.html">function compose, type cut, and the algebra of logic</a> (<a href="http://xieyuheng.github.io/paper/function-compose-type-cut.pdf">paper</a>) (<a href="./output/function-compose-type-cut--demo.html">demo</a>)</p><p>for the ICFP 2016 at Nara</p></li></ul>
</div>
</div>

<div id="outline-container-org2efae31" class="outline-2">
<h2 id="org2efae31">translation</h2>
<div class="outline-text-2" id="text-org2efae31">
<ul class="org-ul">
<li><p><a href="./translation/is-god-a-taoist.html">is god a taoist / 上帝是道家的嗎</a></p><p>by Raymond Smullyan, 1977</p></li>

<li><p><a href="./translation/schizophrenia-in-contemporary-mathematics.html">schizophrenia in contemporary mathematics / 當代數學之精神分裂症</a></p><p>by Errett Bishop, 1973</p><p></p><p><ul class="org-ul"></p><p><li><p>four basic principles for constructivism / 構造主義基本四原則</p><p></p><p><ul class="org-ul"></p><p><li><p>(A) Mathematics is common sense.</p><p>(B) Do not ask whether a statement is true until you know what it means.</p><p>(C) A proof is any completely convincing argument.</p><p>(D) Meaningful distinctions deserve to be maintained.</p></li></p><p></p><p><li><p>(A) 數學即常識</p><p>(B) 別問一個論斷是否真實 除非你明瞭論斷的意思</p><p>(C) 使你信服的論證皆爲證明</p><p>(D) 有意義的區別值得保留</p></li></ul></p></li></ul></p></li>

<li><p><a href="./translation/a-constructivist-manifesto.html">a constructivist manifesto / 一個構造主義者的宣言</a></p><p>by Errett Bishop, 1967</p></li></ul>
</div>
</div>

<div id="outline-container-org29efd88" class="outline-2">
<h2 id="org29efd88">lecture</h2>
<div class="outline-text-2" id="text-org29efd88">
<ul class="org-ul">
<li><p><a href="http://the-little-language-designer.github.io/cicada-nymph/course/contents.html">experimental assembly programming experiment</a></p><p>at SYSU, GuangZhou, 2015</p></li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2018-03-04 Sun 22:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
